diagrams/component.pu
@startuml
package "Redux" {
  [Actions]
  [Reducer]
  [Store]
}

[React Components] --> [Actions]
[Actions] --> [Store]
[Store] --> [Reducer]
[Reducer] --> [Store]
@enduml
